[
    {
      "title": "Recipe Rater",
      "image": "/portfolio/images/reciperater.png",
      "description": "Analyzed a dataset of 234,429 recipe reviews from Food.com with 15 features and built a machine learning model to predict how highly a recipe will be rated (out of 5 stars). This project utilizes EDA, feature engineering, statistical hypothesis testing, and machine learning to develop a practical tool for smarter recipe selection.",
      "year": "2024",
      "link": "https://github.com/lindbergryan04/RecipeRater/tree/main"
    },
    {
      "title": "Recipe Rater Report",
      "image": "/portfolio/images/reciperaterreport.png",
      "description": "In depth report of Recipe Rater project.",
      "year": "2024",
      "link": "https://lindbergryan04.github.io/RecipeRater_report/"
    },
    {
      "title": "Amazon Inflation Analysis",
      "image": "/portfolio/images/amazoninflationanalysis.png",
      "description": "Analyzed Amazon price trends from 2021–2024 and compared them with Consumer Price Index (CPI) data to evaluate how closely Amazon’s pricing aligns with inflation. Leveraged Keepa and BLS data using statistical testing and data visualization to uncover sector-specific patterns and pricing behaviors.",
      "year": "2024",
      "link": "https://github.com/lindbergryan04/AmazonInflationAnalysis/blob/master/FinalProject_Group031_WI25.ipynb"
    },
    {
      "title": "Apple Quality Prediction Model",
      "image": "/portfolio/images/appleprediction.png",
      "description": "Using and exploring basic models to predict apple quality.",
      "year": "2022",
      "link": "https://github.com/lindbergryan04/apple-prediction-models/blob/main/ApplePredictionModel.ipynb"
    },
    {
      "title": "Adipisci incidunt dolores non.",
      "image": "https://vis-society.github.io/labs/2/images/empty.svg",
      "description": "Totam accusamus vero pariatur. Nemo, nesciunt facere tenetur omnis possimus expedita debitis iste vero perspiciatis dolorem saepe? Ducimus, harum assumenda expedita corporis beatae praesentium et dolor fugiat, distinctio, ab rerum.",
      "year": "",
      "link": ""
    },
    {
      "title": "Quibusdam excepturi error vero?",
      "image": "https://vis-society.github.io/labs/2/images/empty.svg",
      "description": "Aspernatur, itaque. Repellendus ipsum sed harum, quia a, quisquam possimus sapiente porro sequi, eos accusamus quo eligendi. Eveniet doloremque id consequuntur in quis, a sequi possimus mollitia rerum labore. Saepe.",
      "year": "",
      "link": ""
    },
    {
      "title": "Sapiente praesentium eaque quam.",
      "image": "https://vis-society.github.io/labs/2/images/empty.svg",
      "description": "Delectus fugiat ullam adipisci, obcaecati odio reiciendis autem nulla exercitationem ratione officia facilis suscipit corrupti necessitatibus aperiam totam deserunt beatae maxime quod eligendi soluta quisquam temporibus ad. Laboriosam, perspiciatis architecto.",
      "year": "",
      "link": ""
    },
    {
      "title": "Distinctio qui pariatur temporibus.",
      "image": "https://vis-society.github.io/labs/2/images/empty.svg",
      "description": "Autem beatae neque eligendi deserunt id! Earum quo a nam doloremque qui eius enim debitis animi atque repudiandae corporis, in exercitationem ipsum. Cumque quibusdam quos numquam quas dolorum! Enim, illum.",
      "year": "",
      "link": ""
    },
    {
      "title": "Saepe doloribus sint voluptates?",
      "image": "https://vis-society.github.io/labs/2/images/empty.svg",
      "description": "Ipsam ea, in cupiditate a alias labore dignissimos exercitationem tenetur eos similique optio quae ullam laboriosam voluptates porro qui voluptatem culpa recusandae? Excepturi sint, expedita rerum cumque tempore suscipit delectus!",
      "year": "",
      "link": ""
    },
    {
      "title": "Itaque dolor quis ipsa!",
      "image": "https://vis-society.github.io/labs/2/images/empty.svg",
      "description": "Impedit alias architecto reiciendis totam molestiae. Impedit nulla dolore nemo optio, officia a quam vel blanditiis quia natus nisi ullam ipsum sequi quis quaerat? Soluta dolor officia voluptas inventore id!",
      "year": "",
      "link": ""
    },
    {
      "title": "Natus totam laudantium exercitationem?",
      "image": "https://vis-society.github.io/labs/2/images/empty.svg",
      "description": "Nobis, cupiditate amet aliquam numquam nesciunt fugiat nihil quasi illo quo deserunt ipsum quia excepturi quis voluptas sunt at accusantium dolores explicabo expedita molestiae dolor, reprehenderit, mollitia incidunt! Commodi, odio.",
      "year": "",
      "link": ""
    },
    {
      "title": "Nesciunt esse iusto tempora!",
      "image": "https://vis-society.github.io/labs/2/images/empty.svg",
      "description": "Quas atque vitae provident qui, voluptatum esse itaque corporis. At doloribus doloremque qui beatae debitis quas ea, voluptas enim dicta quae laboriosam illo, eveniet voluptatem velit expedita repellendus ut maiores.",
      "year": "",
      "link": ""
    }
  ]
  